package com.mdsd.cloud.enumeration;

import lombok.Getter;

/**
 * @author WangYunwei [2022-05-12]
 */
@Getter
public enum DictionaryEnum {

    /**
     * 性别
     */
    PHFA_0001("性别", "PHFA_0001"),
    /**
     * 年龄类别
     */
    PHFA_0002("年龄类别", "PHFA_0002"),
    /**
     * 证件类型
     */
    PHFA_0003("证件类型", "PHFA_0003"),
    /**
     * 民族
     */
    PHFA_0004("民族", "PHFA_0004"),
    /**
     * 民族
     */
    PHFA_0005("民族", "PHFA_0005"),
    /**
     * 急救类型
     */
    PHFA_0006("急救类型", "PHFA_0006"),
    /**
     * 出车分站
     */
    PHFA_0007("出车分站", "PHFA_0007"),
    /**
     * 驾驶员
     */
    PHFA_0008("驾驶员", "PHFA_0008"),
    /**
     * 出诊医生
     */
    PHFA_0009("出诊医生", "PHFA_0009"),
    /**
     * 出诊护士
     */
    PHFA_0010("出诊护士", "PHFA_0010"),
    /**
     * 疾病类别
     */
    PHFA_0011("疾病类别", "PHFA_0011"),
    /**
     * 病史提供者
     */
    PHFA_0012("病史提供者", "PHFA_0012"),
    /**
     * 发病时间
     */
    PHFA_0013("发病时间", "PHFA_0013"),
    /**
     * 既往史
     */
    PHFA_0014("既往史", "PHFA_0014"),
    /**
     * 过敏史
     */
    PHFA_0015("过敏史", "PHFA_0015"),
    /**
     * 意识
     */
    PHFA_0016("意识", "PHFA_0016"),
    /**
     * 皮肤
     */
    PHFA_0017("皮肤", "PHFA_0017"),
    /**
     * 瞳孔
     */
    PHFA_0018("瞳孔", "PHFA_0018"),
    /**
     * 对光反射
     */
    PHFA_0019("对光反射", "PHFA_0019"),
    /**
     * TnT
     */
    PHFA_0020("TnT", "PHFA_0020"),
    /**
     * TnI
     */
    PHFA_0021("TnI", "PHFA_0021"),
    /**
     * D-二聚体
     */
    PHFA_0022("D-二聚体", "PHFA_0022"),
    /**
     * 血清肌酐
     */
    PHFA_0023("血清肌酐", "PHFA_0023"),
    /**
     * CKMB
     */
    PHFA_0024("CKMB", "PHFA_0024"),
    /**
     * BNP
     */
    PHFA_0025("BNP", "PHFA_0025"),
    /**
     * NT-proBNP
     */
    PHFA_0026("NT-proBNP", "PHFA_0026"),
    /**
     * Myo
     */
    PHFA_0027("Myo", "PHFA_0027"),
    /**
     * 神经系统疾病
     */
    PHFA_0028("神经系统疾病", "PHFA_0028"),
    /**
     * 循环系统疾病
     */
    PHFA_0029("循环系统疾病", "PHFA_0029"),
    /**
     * 病情判断
     */
    PHFA_0030("病情判断", "PHFA_0030"),
    /**
     * 急救措施
     */
    PHFA_0031("急救措施", "PHFA_0031"),
    /**
     * 病情转归
     */
    PHFA_0032("病情转归", "PHFA_0032"),
    /**
     * 出诊结果
     */
    PHFA_0033("出诊结果", "PHFA_0033"),
    /**
     * 任务状态
     */
    PHFA_0034("任务状态", "PHFA_0034"),
    /**
     * 健康码
     */
    PHFA_0035("健康码", "PHFA_0035"),
    /**
     * 任务模板
     */
    PHFA_0036("任务模板", "PHFA_0036"),
    /**
     * 胸痛评估_病情评估
     */
    PHFA_0037("胸痛评估_病情评估", "PHFA_0037"),
    /**
     * 胸痛评估_其它症状
     */
    PHFA_0038("胸痛评估_其它症状", "PHFA_0038"),
    /**
     * FAST评估_F(脸)
     */
    PHFA_0039("FAST评估_F(脸)", "PHFA_0039"),
    /**
     * FAST评估_A(手臂)
     */
    PHFA_0040("FAST评估_A(手臂)", "PHFA_0040"),
    /**
     * FAST评估_S(语言)
     */
    PHFA_0041("FAST评估_S(语言)", "PHFA_0041"),
    /**
     * GCS评分_睁眼反应
     */
    PHFA_0042("GCS评分_睁眼反应", "PHFA_0042"),
    /**
     * GCS评分_语音反应
     */
    PHFA_0043("GCS评分_语音反应", "PHFA_0043"),
    /**
     * GCS评分_肢体运动
     */
    PHFA_0044("GCS评分_肢体运动", "PHFA_0044"),
    /**
     * Killip_评估结果
     */
    PHFA_0045("Killip_评估结果", "PHFA_0045"),
    /**
     * TI_评估结果
     */
    PHFA_0046("TI_评估结果", "PHFA_0046"),
    /**
     * 胸痛评估_病情评估
     */
    PHFA_0047("胸痛评估_病情评估", "PHFA_0047"),
    /**
     * GCS_评估结果
     */
    PHFA_0048("GCS_评估结果", "PHFA_0048"),
    /**
     * killip
     */
    PHFA_0049("killip", "PHFA_0049"),
    /**
     * TI评估_受伤部位
     */
    PHFA_0050("TI评估_受伤部位", "PHFA_0050"),
    /**
     * TI评估_受伤类型
     */
    PHFA_0051("TI评估_受伤类型", "PHFA_0051"),
    /**
     * TI评估_脉搏
     */
    PHFA_0052("TI评估_脉搏", "PHFA_0052"),
    /**
     * TI评估_意识状态
     */
    PHFA_0053("TI评估_意识状态", "PHFA_0053"),
    /**
     * TI评估_呼吸状态
     */
    PHFA_0054("TI评估_呼吸状态", "PHFA_0054"),
    /**
     * 药品用法
     */
    PHFA_0055("药品用法", "PHFA_0055"),
    /**
     * 通信行程码
     */
    PHFA_0056("通信行程码", "PHFA_0056"),
    /**
     * 初步诊断
     */
    PHFA_0057("初步诊断", "PHFA_0057"),
    /**
     * 交接科室
     */
    PHFA_0058("交接科室", "PHFA_0058"),
    /**
     * 病历状态
     */
    PHFA_0059("病历状态", "PHFA_0059"),
    /**
     * 项目ID
     */
    PHFA_0060("项目ID", "PHFA_0060"),
    /**
     * 是否
     */
    PHFA_0061("是否", "PHFA_0061"),
    /**
     * IM请求超链接
     */
    PHFA_0062("IM请求超链接", "PHFA_0062"),
    /**
     * 文件类别
     */
    PHFA_0064("文件类别", "PHFA_0064"),
    /**
     * 病历完成超时
     */
    PHFA_0065("病历时间", "PHFA_0065"),
    /**
     * 任务终止类型
     */
    PHFA_0066("任务终止类型", "PHFA_0066");

    private final String key;

    private final String value;

    DictionaryEnum(final String key, final String value) {

        this.key = key;
        this.value = value;
    }
}
